# Practical 1: Data Collection, Modelling and Compilation

Data Collection: Data Collection is defined as the procedure of collecting, measuring and analyzing accurate insights for research using standard validated techniques. A researcher can evaluate their hypothesis on the basis of collected data. In most cases, data collection is the primary and most important step for research, irrespective of the field of research. The approach of data collection is different for different fields of study, depending on the required information. The most critical objective of data collection is ensuring that information-rich and reliable data is collected for statistical analysis so that data-driven decisions can be made for research.

Data Collection and Datasets




From .csv files

In [1]:
import pandas as pd
import numpy as np

In [2]:
my_dict = {'name' : ["a", "b", "c", "d", "e", "f", "g"],
          'age' : [20, 27, 35, 55, 18, 21, 35],
          'designation' : ["VP", "CEO", "CFO", "VP", "VP", "CEO", "MD"]}

In [3]:
df = pd.DataFrame(my_dict)

In [4]:
df

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

In [5]:
df.to_csv('csv_fds')

In [6]:
df

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

In [7]:
df.to_csv('csv_fds2', index = False)

In [8]:
df_csv = pd.read_csv('csv_fds2')

In [9]:
df_csv

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

In [10]:
import pandas as pd

In [13]:
Location = "student-mat.csv"

In [14]:
df = pd.read_csv(Location, header = None)

In [15]:
df.head()

,0,1,2,3,4,5,6,7,8,9,...,23,24,25,26,27,28,29,30,31,32
0,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
1,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
2,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
3,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
4,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15

In [16]:
df = pd.read_csv(Location)

In [17]:
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

In [18]:
import pandas as pd

In [19]:
names = ['Bob','Jessica','Mary','John','Mel']

In [20]:
grades = [76,95,77,78,99]

In [23]:
bsdegrees = [1,1,0,0,1]

In [24]:
msdegrees = [2,1,0,0,0]

In [25]:
phddegrees = [0,1,0,0,0]

In [26]:
Degrees = zip(names,grades,bsdegrees,msdegrees,phddegrees)

In [27]:
columns = ['Names','Grades','BS','MS','PhD']

In [29]:
df = pd.DataFrame(data = Degrees, columns = columns)

In [30]:
df

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0

-------------------------------------------------------------------------------------------------------------------------------
From Excel files

In [36]:
import pandas as pd

In [37]:
LocationE = "gradedata.xlsx"

In [39]:
df = pd.read_excel(LocationE)

In [42]:
#Changing Columns Names
df.columns = ['first','last','sex','age','exer','hrs','grd','addr']

In [41]:
df.head()

,first,last,sex,age,exer,hrs,grd,addr
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

In [43]:
import pandas as pd

In [44]:
names = ['Bob','Jessica','Mary','John','Mel']

In [45]:
grades = [76,95,77,78,99]

In [46]:
GradeList = zip(names,grades)

In [47]:
df = pd.DataFrame(data = GradeList,columns = ['Names','Grades'])

In [49]:
writer = pd.ExcelWriter('dataframe_FDS.xlsx', engine = 'xlsxwriter')

In [50]:
df.to_excel(writer, sheet_name = 'Sheet1')

In [51]:
writer.save()

-------------------------------------------------------------------------------------------------------------------------------
From SQL files

In [54]:
import sqlite3

In [55]:
#Create a SQL connection to our SQLite database
con = sqlite3.connect("portal_mammals.sqlite")

In [56]:
cur = con.cursor()

In [57]:
#The result of a "cursor.execute" can be iterated over by row
for row in cur.execute('SELECT * FROM species;'):
    print(row)

('AB', 'Amphispiza', 'bilineata', 'Bird')
('AH', 'Ammospermophilus', 'harrisi', 'Rodent')
('AS', 'Ammodramus', 'savannarum', 'Bird')
('BA', 'Baiomys', 'taylori', 'Rodent')
('CB', 'Campylorhynchus', 'brunneicapillus', 'Bird')
('CM', 'Calamospiza', 'melanocorys', 'Bird')
('CQ', 'Callipepla', 'squamata', 'Bird')
('CS', 'Crotalus', 'scutalatus', 'Reptile')
('CT', 'Cnemidophorus', 'tigris', 'Reptile')
('CU', 'Cnemidophorus', 'uniparens', 'Reptile')
('CV', 'Crotalus', 'viridis', 'Reptile')
('DM', 'Dipodomys', 'merriami', 'Rodent')
('DO', 'Dipodomys', 'ordii', 'Rodent')
('DS', 'Dipodomys', 'spectabilis', 'Rodent')
('DX', 'Dipodomys', 'sp.', 'Rodent')
('EO', 'Eumeces', 'obsoletus', 'Reptile')
('GS', 'Gambelia', 'silus', 'Reptile')
('NL', 'Neotoma', 'albigula', 'Rodent')
('NX', 'Neotoma', 'sp.', 'Rodent')
('OL', 'Onychomys', 'leucogaster', 'Rodent')
('OT', 'Onychomys', 'torridus', 'Rodent')
('OX', 'Onychomys', 'sp.', 'Rodent')
('PB', 'Chaetodipus', 'baileyi', 'Rodent')
('PC', 'Pipilo', 'chlorurus', 'Bird')
('PE', 'Peromyscus', 'eremicus', 'Rodent')
('PF', 'Perognathus', 'flavus', 'Rodent')
('PG', 'Pooecetes', 'gramineus', 'Bird')
('PH', 'Perognathus', 'hispidus', 'Rodent')
('PI', 'Chaetodipus', 'intermedius', 'Rodent')
('PL', 'Peromyscus', 'leucopus', 'Rodent')
('PM', 'Peromyscus', 'maniculatus', 'Rodent')
('PP', 'Chaetodipus', 'penicillatus', 'Rodent')
('PU', 'Pipilo', 'fuscus', 'Bird')
('PX', 'Chaetodipus', 'sp.', 'Rodent')
('RF', 'Reithrodontomys', 'fulvescens', 'Rodent')
('RM', 'Reithrodontomys', 'megalotis', 'Rodent')
('RO', 'Reithrodontomys', 'montanus', 'Rodent')
('RX', 'Reithrodontomys', 'sp.', 'Rodent')
('SA', 'Sylvilagus', 'audubonii', 'Rabbit')
('SB', 'Spizella', 'breweri', 'Bird')
('SC', 'Sceloporus', 'clarki', 'Reptile')
('SF', 'Sigmodon', 'fulviventer', 'Rodent')
('SH', 'Sigmodon', 'hispidus', 'Rodent')
('SO', 'Sigmodon', 'ochrognathus', 'Rodent')
('SS', 'Spermophilus', 'spilosoma', 'Rodent')
('ST', 'Spermophilus', 'tereticaudus', 'Rodent')
('SU', 'Sceloporus', 'undulatus', 'Reptile')
('SX', 'Sigmodon', 'sp.', 'Rodent')
('UL', 'Lizard', 'sp.', 'Reptile')
('UP', 'Pipilo', 'sp.', 'Bird')
('UR', 'Rodent', 'sp.', 'Rodent')
('US', 'Sparrow', 'sp.', 'Bird')
('ZL', 'Zonotrichia', 'leucophrys', 'Bird')
('ZM', 'Zenaida', 'macroura', 'Bird')

In [59]:
#Be sure to close the connection
con.close()

In [60]:
import sqlite3

In [61]:
#Create a SQL connection to our SQLite database
con = sqlite3.connect("portal_mammals.sqlite")

In [62]:
cur = con.cursor()

In [64]:
#Return all results of query
cur.execute('SELECT plot_id FROM plots WHERE plot_type="Control"')
print(cur.fetchall())

[(2,), (4,), (8,), (11,), (12,), (14,), (17,), (22,)]

In [65]:
#Return first result of the query
cur.execute('SELECT species FROM species WHERE taxa="Bird"')
print(cur.fetchone())

('bilineata',)

In [66]:
#Be sure to close the connection
con.close()

Saving data to SQL

In [67]:
from pandas import DataFrame

In [68]:
Cars = {'Brand':['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
       'Price':[22000,25000,27000,35000]}

In [69]:
df = DataFrame(Cars,columns=['Brand','Price'])

In [70]:
df

            Brand  Price
0     Honda Civic  22000
1  Toyota Corolla  25000
2      Ford Focus  27000
3         Audi A4  35000

In [71]:
import sqlite3

In [74]:
conn = sqlite3.connect('TestDB1_FDS.db')

In [75]:
c = conn.cursor()

In [78]:
c.execute('CREATE TABLE CARS1_FDS(Brand text, Price number)')
conn.commit()

In [79]:
df.to_sql('CARS',conn,if_exists='replace',index=False)

In [81]:
c.execute('''SELECT Brand,max(Price) from CARS''')
conn.commit()

In [82]:
df = DataFrame(c.fetchall(),columns=['Brand','Price'])

In [83]:
df

     Brand  Price
0  Audi A4  35000